ISouthRain/HC32F448-template/.pack/HDSC/HC32F448.1.0.1/Device/Include/HC32F448KATI.h
/**
 *******************************************************************************
 * @file  HC32F448KATI.h
 * @brief Headerfile for HC32F448KATI series MCU
 @verbatim
   Change Logs:
   Date             Author          Notes
   2023-05-31       CDT             First version
   xxxx-xx-xx       CDT             Optimize TMR4_OCMRxx
                                    Rename EMB_CTL1 register bit: SRAMERREN -> SRAMECCERREN
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2022-2023, Xiaohua Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by XHSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 **/

#ifndef __HC32F448KATI_H__
#define __HC32F448KATI_H__

#ifdef __cplusplus
extern "C" {
#endif

/*******************************************************************************
 * Configuration of the Cortex-M4 Processor and Core Peripherals
 ******************************************************************************/
#define __MPU_PRESENT             1       /*!< HC32F448KATI provides MPU                                */
#define __VTOR_PRESENT            1       /*!< HC32F448KATI supported vector table registers            */
#define __NVIC_PRIO_BITS          4       /*!< HC32F448KATI uses 4 Bits for the Priority Levels         */
#define __Vendor_SysTickConfig    0       /*!< Set to 1 if different SysTick Config is used         */
#define __FPU_PRESENT             1       /*!< FPU present                                          */

/*******************************************************************************
 * Interrupt Number Definition
 ******************************************************************************/
typedef enum {
    NMI_IRQn                    = -14, /*  2 Non Maskable                     */
    HardFault_IRQn              = -13, /*  3 Hard Fault                       */
    MemManageFault_IRQn         = -12, /*  4 MemManage Fault                  */
    BusFault_IRQn               = -11, /*  5 Bus Fault                        */
    UsageFault_IRQn             = -10, /*  6 Usage Fault                      */
    SVC_IRQn                    = -5,  /* 11 SVCall                           */
    DebugMonitor_IRQn           = -4,  /* 12 DebugMonitor                     */
    PendSV_IRQn                 = -2,  /* 14 Pend SV                          */
    SysTick_IRQn                = -1,  /* 15 System Tick                      */
    INT000_IRQn                 = 0,
    INT001_IRQn                 = 1,
    INT002_IRQn                 = 2,
    INT003_IRQn                 = 3,
    INT004_IRQn                 = 4,
    INT005_IRQn                 = 5,
    INT006_IRQn                 = 6,
    INT007_IRQn                 = 7,
    INT008_IRQn                 = 8,
    INT009_IRQn                 = 9,
    INT010_IRQn                 = 10,
    INT011_IRQn                 = 11,
    INT012_IRQn                 = 12,
    INT013_IRQn                 = 13,
    INT014_IRQn                 = 14,
    INT015_IRQn                 = 15,
    EXTINT_PORT_EIRQ0_IRQn      = 16,
    EXTINT_PORT_EIRQ1_IRQn      = 17,
    EXTINT_PORT_EIRQ2_IRQn      = 18,
    EXTINT_PORT_EIRQ3_IRQn      = 19,
    EXTINT_PORT_EIRQ4_IRQn      = 20,
    EXTINT_PORT_EIRQ5_IRQn      = 21,
    EXTINT_PORT_EIRQ6_IRQn      = 22,
    EXTINT_PORT_EIRQ7_IRQn      = 23,
    EXTINT_PORT_EIRQ8_IRQn      = 24,
    EXTINT_PORT_EIRQ9_IRQn      = 25,
    EXTINT_PORT_EIRQ10_IRQn     = 26,
    EXTINT_PORT_EIRQ11_IRQn     = 27,
    EXTINT_PORT_EIRQ12_IRQn     = 28,
    EXTINT_PORT_EIRQ13_IRQn     = 29,
    EXTINT_PORT_EIRQ14_IRQn     = 30,
    EXTINT_PORT_EIRQ15_IRQn     = 31,
    SWINT0_IRQn                 = 0,
    SWINT1_IRQn                 = 1,
    SWINT2_IRQn                 = 2,
    SWINT3_IRQn                 = 3,
    SWINT4_IRQn                 = 4,
    SWINT5_IRQn                 = 5,
    SWINT6_IRQn                 = 6,
    SWINT7_IRQn                 = 7,
    SWINT8_IRQn                 = 8,
    SWINT9_IRQn                 = 9,
    SWINT10_IRQn                = 10,
    SWINT11_IRQn                = 11,
    SWINT12_IRQn                = 12,
    SWINT13_IRQn                = 13,
    SWINT14_IRQn                = 14,
    SWINT15_IRQn                = 15,
    SWINT16_IRQn                = 16,
    SWINT17_IRQn                = 17,
    SWINT18_IRQn                = 18,
    SWINT19_IRQn                = 19,
    SWINT20_IRQn                = 20,
    SWINT21_IRQn                = 21,
    SWINT22_IRQn                = 22,
    SWINT23_IRQn                = 23,
    SWINT24_IRQn                = 24,
    SWINT25_IRQn                = 25,
    SWINT26_IRQn                = 26,
    SWINT27_IRQn                = 27,
    SWINT28_IRQn                = 28,
    SWINT29_IRQn                = 29,
    SWINT30_IRQn                = 30,
    SWINT31_IRQn                = 31,
    DMA1_ERR_IRQn               = 32,
    DMA1_TC0_BTC0_IRQn          = 33,
    DMA1_TC1_BTC1_IRQn          = 34,
    DMA1_TC2_BTC2_IRQn          = 35,
    DMA1_TC3_BTC3_IRQn          = 36,
    DMA1_TC4_BTC4_IRQn          = 37,
    DMA1_TC5_BTC5_IRQn          = 38,
    EFM_PEERR_RDCOL_IRQn        = 39,
    EFM_OPTEND_IRQn             = 40,
    QSPI_IRQn                   = 41,
    DCU1_IRQn                   = 42,
    DCU2_IRQn                   = 43,
    DCU3_IRQn                   = 44,
    DCU4_IRQn                   = 45,
    DMA2_ERR_IRQn               = 46,
    DMA2_TC0_BTC0_IRQn          = 47,
    DMA2_TC1_BTC1_IRQn          = 48,
    DMA2_TC2_BTC2_IRQn          = 49,
    DMA2_TC3_BTC3_IRQn          = 50,
    DMA2_TC4_BTC4_IRQn          = 51,
    DMA2_TC5_BTC5_IRQn          = 52,
    TMR0_1_IRQn                 = 53,
    TMR0_2_IRQn                 = 54,
    RTC_IRQn                    = 55,
    XTAL_IRQn                   = 56,
    WKTM_IRQn                   = 57,
    SWDT_IRQn                   = 58,
    TMR6_1_GCMP_IRQn            = 59,
    TMR6_1_OVF_UDF_IRQn         = 60,
    TMR6_1_DTE_IRQn             = 61,
    TMR6_1_SCMP_IRQn            = 62,
    TMRA_1_OVF_UDF_IRQn         = 63,
    TMRA_1_CMP_IRQn             = 64,
    TMR6_2_GCMP_IRQn            = 65,
    TMR6_2_OVF_UDF_IRQn         = 66,
    TMR6_2_DTE_IRQn             = 67,
    TMR6_2_SCMP_IRQn            = 68,
    TMRA_2_OVF_UDF_IRQn         = 69,
    TMRA_2_CMP_IRQn             = 70,
    TMRA_3_OVF_UDF_IRQn         = 71,
    TMRA_3_CMP_IRQn             = 72,
    TMRA_4_OVF_UDF_IRQn         = 73,
    TMRA_4_CMP_IRQn             = 74,
    TMR4_1_GCMP_IRQn            = 75,
    TMR4_1_OVF_UDF_IRQn         = 76,
    TMR4_1_RELOAD_IRQn          = 77,
    TMR4_1_SCMP_IRQn            = 78,
    TMR4_2_GCMP_IRQn            = 79,
    TMR4_2_OVF_UDF_IRQn         = 80,
    TMR4_2_RELOAD_IRQn          = 81,
    TMR4_2_SCMP_IRQn            = 82,
    TMR4_3_GCMP_IRQn            = 83,
    TMR4_3_OVF_UDF_IRQn         = 84,
    TMR4_3_RELOAD_IRQn          = 85,
    TMR4_3_SCMP_IRQn            = 86,
    I2C1_IRQn                   = 87,
    I2C2_IRQn                   = 88,
    CMP1_IRQ_IRQn               = 89,
    CMP2_IRQ_IRQn               = 90,
    CMP3_IRQ_IRQn               = 91,
    CMP4_IRQ_IRQn               = 92,
    USART1_IRQn                 = 93,
    USART1_TCI_IRQn             = 94,
    USART2_IRQn                 = 95,
    USART2_TCI_IRQn             = 96,
    SPI1_IRQn                   = 97,
    TMRA_5_OVF_UDF_IRQn         = 98,
    TMRA_5_CMP_IRQn             = 99,
    EVENT_PORT1_IRQn            = 100,
    EVENT_PORT2_IRQn            = 101,
    EVENT_PORT3_IRQn            = 102,
    EVENT_PORT4_IRQn            = 103,
    USART3_IRQn                 = 104,
    USART3_TCI_IRQn             = 105,
    USART4_IRQn                 = 106,
    USART4_TCI_IRQn             = 107,
    SPI2_IRQn                   = 108,
    SPI3_IRQn                   = 109,
    EMB_GR0_IRQn                = 110,
    EMB_GR1_IRQn                = 111,
    EMB_GR2_IRQn                = 112,
    EMB_GR3_IRQn                = 113,
    USART5_IRQn                 = 114,
    USART5_TCI_IRQn             = 115,
    USART6_IRQn                 = 116,
    USART6_TCI_IRQn             = 117,
    MCAN1_INT0_IRQn             = 118,
    MCAN1_INT1_IRQn             = 119,
    MCAN2_INT0_IRQn             = 120,
    MCAN2_INT1_IRQn             = 121,
    USART1_WUPI_IRQn            = 122,
    FCM_IRQn                    = 125,
    WDT_IRQn                    = 126,
    CTC_IRQn                    = 127,
    ADC1_IRQn                   = 128,
    ADC2_IRQn                   = 129,
    ADC3_IRQn                   = 130,
    TRNG_IRQn                   = 131,
} IRQn_Type;

#include <core_cm4.h>
#include <stdint.h>

